# Taps
tap "homebrew/bundle"

# Brews (Packages)
brew "bat"
brew "bat-extras"
brew "eza"
brew "git"
brew "httpie"
brew "less"
brew "mas"
brew "n"
brew "nano"
brew "starship"
brew "zsh"

# Casks (Applications)
cask "1password"
cask "discord"
cask "dropbox"
cask "gitkraken"
cask "google-chrome"
cask "iterm2"
cask "raycast"
cask "slack"
cask "visual-studio-code"

cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-space-mono-nerd-font'