# Taps
tap 'homebrew/bundle'

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew 'bat'
brew 'bat-extras'
brew 'eza'
brew 'fortune'
brew 'git'
brew 'httpie'
brew 'less'
brew 'nano'
brew 'mackup'
brew 'mas'
brew 'neofetch'
brew 'ranger'
brew 'starship'
brew 'tldr'
brew 'zsh'

# CLI Development Suits
brew 'git-delta'
brew 'lazydocker'
brew 'lazygit'

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'gitkraken'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'ray'
cask 'tableplus'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'warp'

# Development Langs, Compilers, Package Managers and SDKs
brew 'composer'
brew 'n'
brew 'node'
brew 'npm'
brew 'php'

# DevOps
cask 'docker'

# Development Utils
brew 'gh'

#############################################################
# Desktop Applications                                      #
#############################################################

# Creativity
cask 'audacity'

# Media
cask '4k-video-downloader'
cask 'spotify'
cask 'vlc'

# Personal Applications
cask '1password'
cask 'android-file-transfer'
cask 'cleanmymac'
cask 'dropbox'
cask 'fantastical'
cask 'figma'
cask 'grammarly'
cask 'grammarly-desktop'
cask 'powerphotos'
cask 'quicken'
cask 'synology-drive'
cask 'zoom'

# Browsers
cask 'arc'
cask 'google-chrome'
cask 'firefox'

# Chat Applications
cask 'discord'
cask 'microsoft-teams'
cask 'slack'

# Productivity
cask 'notion'
cask 'time-out'

#############################################################
# Content Creation                                          #
#############################################################

# Video
cask 'ecamm-live'

# Podcasting
cask 'forecast'

# Other
cask 'elgato-camera-hub'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'focusrite-control'

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono'
cask 'font-meslo-lg-nerd-font'

# Mac OS Mods and Improvements
cask 'alfred'
cask 'alt-tab'
cask 'bartender'
cask 'caffeine'
cask 'istat-menus'
cask 'raycast'
cask 'the-unarchiver'

# Mac App Store
mas 'Todoist', id: 585829637

# EOF
