# Taps
tap "homebrew/bundle"

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "eza"
brew "fzf"
brew "fortune"
brew "git"
brew "grip"
brew "httpie"
brew "less"
brew "mackup"
brew "mas"
brew "neofetch"
brew "neovim"
brew "ranger"
brew "starship"
brew "tldr"
brew "tmux"
brew "wget"
brew "xdg-ninja"
brew "zoxide"
brew "zsh"

# CLI Development Suits
brew "git-delta"
brew "lazydocker"
brew "lazygit"

#############################################################
# Software Development                                      #
#############################################################

# Development Apps
cask 'android-studio'
cask 'gitkraken'
cask 'gitkraken-cli'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'ray'
cask 'tableplus'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'warp'

# Development Langs, Compilers, Package Managers and SDKs
brew "composer"
brew "n"
brew "nano"
brew "node"
brew "npm"
brew "php"

# DevOps
cask 'docker'

# Development Utils
brew "gh"

#############################################################
# Desktop Applications                                      #
#############################################################

# Creativity
cask 'audacity'

# Media
cask '4k-video-downloader'
cask 'spotify'

# Personal Applications
cask '1password'
cask 'android-file-transfer'
cask 'cleanmymac'
cask 'dropbox'
cask 'fantastical'
cask 'figma'
cask 'grammarly-desktop'
cask 'microsoft-teams'
cask 'powerphotos'
cask 'quicken'
cask 'synology-drive'
cask 'zoom'

# Browsers
cask 'arc'
cask 'google-chrome'
cask 'firefox'

# Chat Applications
cask 'discord'
cask 'slack'

# Productivity
cask 'notion'
cask 'time-out'

#############################################################
# Content Creation                                          #
#############################################################

# Video
cask 'ecamm-live'

# Podcasting
cask 'forecast'

# Other
cask 'elgato-camera-hub'
cask 'elgato-control-center'
cask 'elgato-stream-deck'
cask 'focusrite-control'

#############################################################
# MacOS-Specific Stuff                                      #
#############################################################

# Fonts
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-space-mono-nerd-font'

# Mac OS Mods and Improvements
cask 'alt-tab'
cask 'bartender'
cask 'caffeine'
cask 'istat-menus'
cask 'raycast'
cask 'the-unarchiver'

# Mac App Store
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas 'Todoist', id: 585829637
mas 'Xcode', id: 497799835

# EOF