ahinkle.laravel-model-snippets
bmewburn.vscode-intelephense-client
calebporzio.better-phpunit
codingyu.laravel-goto-view
daylerees.rainglow
EditorConfig.EditorConfig
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
felixfbecker.php-debug
formulahendry.auto-close-tag
heybourn.headwind
junstyle.php-cs-fixer
k--kato.intellij-idea-keybindings
kamikillerto.vscode-colorize
marsl.vscode-php-refactoring
MehediDracula.php-constructor
MehediDracula.php-namespace-resolver
mikestead.dotenv
neilbrayfield.php-docblocker
octref.vetur
patbenatar.advanced-new-file
pkboom.php-test-creator
pnp.polacode
Shan.code-settings-sync
sleistner.vscode-fileutils
softwaredotcom.swdc-vscode
streetsidesoftware.code-spell-checker
vilicvane.sensitive-replace
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wmaurer.change-case
yzhang.markdown-all-in-one
