# Taps
tap "homebrew/bundle"

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew "antidote"
brew "bat"
brew "bat-extras"
brew "coreutils"
brew "dockutil"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "fortune"
brew "git"
brew "gitlint"
brew "grip"
brew "httpie"
brew "less"
brew "mackup"
brew "mas"
brew "neofetch"
brew "neovim"
brew "ranger"
brew "starship"
brew "tldr"
brew "tmux"
brew "wget"
brew "xdg-ninja"
brew "zoxide"
brew "zsh"

# CLI Development Suits
brew "git-delta"
brew "lazydocker"
brew "lazygit"

#############################################################
# Software Development                                      #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew "composer"
brew "n"
brew "nano"
brew "node"
brew "npm"
brew "php"

# Development Utils
brew "gh"

# EOF
