#############################################################
# Homebrew Taps                                             #
#############################################################

tap "homebrew/bundle"
tap "jesseduffield/lazygit"

#############################################################
# Command Line                                              #
#############################################################

# CLI Essentials
brew "bat"
brew "bat-extras"
brew "blueutil"
brew "colordiff"
brew "coreutils"
brew "displayplacer"
brew "dockutil"
brew "doctl"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "fortune"
brew "gh"
brew "ghq"
brew "git"
brew "git-extras"
brew "goto"
brew "grep"
brew "grip"
brew "htop"
brew "httpie"
brew "imapsync"
brew "jq"
brew "less"
brew "mackup"
brew "mas"
brew "m-cli"
brew "neovim"
brew "ranger"
brew "ssh-copy-id"
brew "starship"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "trash-cli"
brew "wget"
brew "xdg-ninja"
brew "zoxide"
brew "zsh"

# CLI Development Suits
brew "git-delta"
brew "lazydocker"
brew "lazygit"

#############################################################
# Software Development                                      #
#############################################################

# Development Langs, Compilers, Package Managers and SDKs
brew "composer"
brew "n"
brew "node"
brew "npm"
brew "php"

# Development Utils
brew "gh"

# EOF
